// Напишите программу которая принимает число на вход и выдает его квадрат
// (число умноеженное на само себя)

Console.WriteLine("Введите число: ");
int namber = Convert.ToInt32(Console.ReadLine());
int result = namber * namber;

Console.WriteLine($"Квадрат числа {namber} будет {result}");

